[
  {
    "id": 1,
    "joke": "Why do programmers prefer dark mode? Because the light attracts bugs."
  },
  {
    "id": 2,
    "joke": "Why don’t skeletons fight each other? They don’t have the guts."
  },
  {
    "id": 3,
    "joke": "How does a penguin build its house? Igloos it together."
  },
  {
    "id": 4,
    "joke": "Why don’t some couples go to the gym? Because some relationships don’t work out."
  },
  {
    "id": 5,
    "joke": "What do you call fake spaghetti? An impasta!"
  },
  {
    "id": 6,
    "joke": "Why did the scarecrow win an award? Because he was outstanding in his field."
  },
  {
    "id": 7,
    "joke": "Why did the coffee file a police report? It got mugged."
  },
  {
    "id": 8,
    "joke": "Why did the web developer go broke? Because he used up all his cache."
  },
  {
    "id": 9,
    "joke": "Why don’t scientists trust atoms? Because they make up everything!"
  },
  {
    "id": 10,
    "joke": "Why did the bicycle fall over? It was two-tired."
  },
  {
    "id": 11,
    "joke": "Why can’t your nose be 12 inches long? Because then it would be a foot."
  },
  {
    "id": 12,
    "joke": "Parallel lines have so much in common… it’s a shame they’ll never meet."
  },
  {
    "id": 13,
    "joke": "I would tell you a construction pun, but I’m still working on it."
  },
  {
    "id": 14,
    "joke": "What do you call cheese that isn’t yours? Nacho cheese."
  },
  {
    "id": 15,
    "joke": "Why did the JavaScript developer leave? Because she didn’t get arrays."
  },
  {
    "id": 16,
    "joke": "How do you organize a space party? You planet."
  },
  {
    "id": 17,
    "joke": "What do you get when you cross a snowman with a vampire? Frostbite."
  },
  {
    "id": 18,
    "joke": "Why was the math book sad? Because it had too many problems."
  },
  {
    "id": 19,
    "joke": "What’s orange and sounds like a parrot? A carrot."
  },
  {
    "id": 20,
    "joke": "I told my computer I needed a break, and now it won’t stop sending me KitKats."
  },
  {
    "id": 21,
    "joke": "Why did the developer go broke? Because he used up all his resources."
  },
  {
    "id": 22,
    "joke": "What’s a computer’s favorite snack? Microchips."
  },
  {
    "id": 23,
    "joke": "Why don’t eggs tell jokes? Because they’d crack each other up."
  },
  {
    "id": 24,
    "joke": "I’m reading a book about anti-gravity. It’s impossible to put down!"
  },
  {
    "id": 25,
    "joke": "Why did the programmer quit his job? Because he didn’t get arrays."
  },
  {
    "id": 26,
    "joke": "What did the janitor say when he jumped out of the closet? Supplies!"
  },
  {
    "id": 27,
    "joke": "How do you find Will Smith in the snow? Look for fresh prints."
  },
  {
    "id": 28,
    "joke": "Why are elevator jokes so classic and good? They work on many levels."
  },
  {
    "id": 29,
    "joke": "How do you make holy water? You boil the hell out of it."
  },
  {
    "id": 30,
    "joke": "Why do bees have sticky hair? Because they use honeycombs."
  },
  {
    "id": 31,
    "joke": "Why don't oysters donate to charity? Because they're shellfish."
  },
  {
    "id": 32,
    "joke": "What’s a cat’s favorite color? Purr-ple."
  },
  {
    "id": 33,
    "joke": "Why did the chicken join a band? Because it had the drumsticks."
  },
  {
    "id": 34,
    "joke": "Why was the computer cold? It left its Windows open."
  },
  {
    "id": 35,
    "joke": "Why did the tomato turn red? Because it saw the salad dressing."
  },
  {
    "id": 36,
    "joke": "Why do ducks have tail feathers? To cover their buttquacks."
  },
  {
    "id": 37,
    "joke": "How do you make a tissue dance? You put a little boogie in it."
  },
  {
    "id": 38,
    "joke": "What’s a skeleton’s favorite instrument? The trom-bone."
  },
  {
    "id": 39,
    "joke": "Why do cows wear bells? Because their horns don’t work."
  },
  {
    "id": 40,
    "joke": "What do you call a factory that makes okay products? A satisfactory."
  },
  {
    "id": 41,
    "joke": "What did the fish say when it hit the wall? Dam."
  },
  {
    "id": 42,
    "joke": "Why did the golfer bring two pairs of pants? In case he got a hole in one."
  },
  {
    "id": 43,
    "joke": "Why did the man run around his bed? Because he was trying to catch up on his sleep."
  },
  {
    "id": 44,
    "joke": "Why don’t programmers like nature? Too many bugs."
  },
  {
    "id": 45,
    "joke": "Why did the cookie go to the hospital? Because it felt crummy."
  },
  {
    "id": 46,
    "joke": "Why are frogs so happy? They eat whatever bugs them."
  },
  {
    "id": 47,
    "joke": "Why did the cow cross the road? To get to the udder side."
  },
  {
    "id": 48,
    "joke": "How do cows stay up to date? They read the moos-paper."
  },
  {
    "id": 49,
    "joke": "Why did the music teacher go to jail? Because she got caught with too many notes."
  },
  {
    "id": 50,
    "joke": "Why was the belt arrested? For holding up pants."
  }
]
